[
  {
    "image": "https://i.ibb.co.com/qFg3N6KZ/download.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Facebook is a global social networking platform designed to connect people, share experiences, and build communities. Users can create personal profiles, connect with friends, post text updates, share images and videos, and engage in discussions through comments and reactions. Facebook also provides Pages for businesses, public figures, and organizations to reach audiences, and Groups for communities to interact around shared interests or causes. The platform features live streaming, Stories, and marketplace tools to buy and sell products, as well as event management for both personal and professional gatherings.\n\nFacebook’s advanced algorithms personalize user feeds based on interactions, likes, and user behavior, enhancing content discovery while providing targeted advertising opportunities for businesses. Messenger, its integrated chat platform, allows for instant messaging, voice calls, and video calls. Users can adjust privacy settings, control who sees their posts, and block or mute others as needed. Businesses can use analytics and insights tools to track engagement and optimize marketing strategies. Facebook Live and Reels enable content creators to reach broader audiences in real time and through short-form video content.\n\nDespite its popularity, Facebook has faced scrutiny over privacy issues, misinformation, and data security. The platform continuously improves its safety features, implements community guidelines, and updates its policies to maintain user trust. From small businesses to large corporations, Facebook remains a central hub for digital marketing, social connection, and news dissemination. Users are encouraged to manage their privacy settings carefully and interact responsibly. Overall, Facebook offers a versatile ecosystem for communication, content sharing, entertainment, and social networking, shaping the way people connect and interact online.",
    "size": "120MB",
    "reviews": "8.5M",
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 350000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 420000 },
      { "name": "4 star", "count": 1700000 },
      { "name": "5 star", "count": 6280000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vCPmh1kH/download-1.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 2,
    "description": "YouTube is a comprehensive video-sharing platform where users can upload, watch, like, comment, and share videos. It offers a wide range of content including entertainment, music, education, tutorials, news, and live streaming events. Content creators can create channels, gather subscribers, monetize videos, and engage in real-time interaction through live chat. YouTube’s algorithm recommends videos based on user interests and viewing history, promoting personalized content discovery.\n\nThe platform supports short-form content (Shorts), long-form videos, playlists, and captions. Students use it for online learning, tutorials, and technology guidance, while businesses and influencers use YouTube for marketing campaigns and brand promotion. YouTube Studio allows creators to manage analytics, monetization, and community interactions. Premium subscriptions and memberships offer additional revenue streams.\n\nYouTube periodically updates its policies and community guidelines to address copyright, content moderation, and safety issues. With billions of users worldwide, YouTube remains a leading platform for video consumption and creation, enabling learning, entertainment, and business growth through interactive and engaging content.",
    "size": "150MB",
    "reviews": "12.5M",
    "ratingAvg": 4.5,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 10450000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0ytHxTLF/download-2.png",
    "title": "Mahfil",
    "companyName": "Mahfil Tech",
    "id": 3,
    "description": "Mahfil is a community-focused platform dedicated to sharing Islamic content, religious discussions, and online learning. It provides access to Quranic studies, Hadith collections, and spiritual guidance, with resources designed for personal growth, knowledge expansion, and community interaction. Users can join topic-specific groups, participate in Q&A sessions, attend webinars, and engage in live discussions.\n\nMahfil features personalized recommendations based on interests, facilitating targeted content delivery. Its moderation system ensures content authenticity and prevents misinformation. The platform supports multi-age users, offering simple navigation, audio-visual learning tools, and interactive educational materials. Daily reminders for prayers, interactive quizzes, and community challenges enrich the learning experience.\n\nMahfil fosters respectful, safe, and informative engagement, aiming to build strong digital communities centered around faith and education. Its secure architecture protects user privacy and encourages responsible interaction. Overall, Mahfil bridges technology with religious knowledge, offering a versatile environment for education, reflection, and community connection.",
    "size": "45MB",
    "reviews": "42K",
    "ratingAvg": 4.6,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 8500 },
      { "name": "5 star", "count": 110100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/B5BDpGdQ/download-1.jpg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "WhatsApp is a globally popular messaging application that offers text messaging, voice messages, audio and video calls, and media sharing. It provides real-time, internet-based communication with group chat functionality, status updates, and end-to-end encryption for secure communication. WhatsApp is widely used for personal and business purposes, providing tools for customer support, marketing, and organizational communication.\n\nFeatures include stickers, GIFs, location sharing, document transfers, and privacy settings for controlling visibility and access. Multi-device support, enhanced voice message playback, and secure backups improve user experience. Users can create groups to connect with family, friends, or colleagues and use business accounts to manage customer inquiries effectively.\n\nDespite its convenience, WhatsApp is subject to privacy discussions and regulatory scrutiny in different regions. Regular updates and security improvements ensure safe communication. Overall, WhatsApp offers fast, reliable, and versatile messaging and calling solutions for personal and professional use, making global connectivity seamless and efficient.",
    "size": "35MB",
    "reviews": "12M",
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 450000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 8500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1YcXFBTc/download-3.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 5,
    "description": "TikTok is a short-form video platform that enables users to create, share, and discover entertaining, creative, and educational content. It offers a variety of editing tools, effects, filters, and a massive music library that allows creators to produce highly engaging videos. The algorithm curates a personalized feed, showcasing content that aligns with user interests, enabling even new creators to gain visibility and followers quickly.\n\nTikTok supports trends, challenges, duets, and reaction videos, making it a hub for viral content. Brands, influencers, and small businesses leverage TikTok to showcase products, run campaigns, and engage audiences interactively. TikTok Live allows real-time interactions, Q&A sessions, and virtual events. Privacy features and parental controls ensure safe usage, especially for younger users.\n\nTikTok continues to grow as a creative outlet and marketing tool, encouraging innovative content production, fostering community engagement, and delivering a dynamic entertainment experience globally.",
    "size": "95MB",
    "reviews": "9.8M",
    "ratingAvg": 4.2,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 130000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 7200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/CsV6ch4X/download-4.png",
    "title": "imo",
    "companyName": "imo.im Inc.",
    "id": 6,
    "description": "imo is a lightweight, fast messaging and video calling app optimized for low-bandwidth environments. It offers group chats, voice messages, sticker sharing, and media transfers, making it convenient for quick communication. The interface is simple, supporting seamless navigation and call quality even on smaller devices.\n\nimo ensures secure communication with end-to-end encryption and privacy controls. Users can participate in group calls, interact with bots, and share multimedia content effortlessly. The platform continuously improves stability and call quality across various network conditions.\n\nimo is ideal for users seeking a reliable, efficient, and lightweight communication tool, especially in regions with limited connectivity, providing a smooth messaging and video calling experience.",
    "size": "30MB",
    "reviews": "650K",
    "ratingAvg": 4.0,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 263000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HpYZ21LV/download-2.jpg",
    "title": "eFootball",
    "companyName": "Konami Digital Entertainment",
    "id": 7,
    "description": "eFootball, formerly known as PES (Pro Evolution Soccer), is a mobile football simulation game that provides players with realistic match experiences, tactics, and team management options. Gamers can use licensed teams and players to participate in tournaments, online multiplayer matches, and special events to earn rewards. The game features high-quality graphics, responsive controls, and smooth animations optimized for mobile devices.\n\nPlayers can engage in team building, player trading, and strategic setup, alongside offline challenges for skill development. Customization options, control settings, and global leaderboards enhance gameplay and competitiveness. Regular seasonal updates bring new teams, players, and in-game content.\n\nOverall, eFootball offers football enthusiasts an immersive and strategic mobile gaming experience, combining skill, competition, and continuous content updates for an engaging sports simulation.",
    "size": "220MB",
    "reviews": "3.1M",
    "ratingAvg": 3.8,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sd5LQLfZ/download.jpg",
    "title": "Muslim Bangla",
    "companyName": "MuslimBangla Ltd.",
    "id": 8,
    "description": "MuslimBangla is a comprehensive Bangla-language Islamic resource app providing Quran translations, Tafsir, Hadith collections, prayer schedules, Duas, and educational articles. Designed for Bangla-speaking Muslims, it facilitates religious learning and daily worship practices. The app includes audio recitations, reading modes, and interactive educational tools for improved understanding.\n\nFeatures include accurate prayer timings with Azan notifications, Qibla direction, religious calendars, quizzes, and daily reminders for worship. Educational videos and articles enhance knowledge, while community sections allow interactive learning and live Q&A sessions with scholars. Content moderation ensures authenticity and reliability of all published materials.\n\nThe user interface is mobile-friendly and accessible across age groups, with strict privacy and security policies protecting user interactions. Overall, MuslimBangla offers a complete religious guide and resource hub for Bengali-speaking Muslims, simplifying worship, education, and community engagement through technology.",
    "size": "48MB",
    "reviews": "45K",
    "ratingAvg": 4.6,
    "downloads": "32M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 8500 },
      { "name": "5 star", "count": 110100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HfCrbF77/download-3.jpg",
    "title": "Quran",
    "companyName": "IslamicTech Ltd.",
    "id": 9,
    "description": "Quran App is a comprehensive mobile platform designed for Muslims worldwide to read, listen, and understand the Holy Quran. It offers full Arabic text along with translations in multiple languages, including English, Urdu, and Bangla. The app provides audio recitations by renowned Qaris, allowing users to follow along while reading. Features like Tajweed rules, verse-by-verse explanations, and transliteration support help beginners and advanced learners alike to accurately recite and comprehend the Quran.\n\nThe app includes bookmarking, night mode, and search functions for quick reference. Daily Quranic verses and notifications encourage consistent reading, while thematic categorization allows users to explore specific topics and guidance. Advanced features include memorization tools, verse sharing, and progress tracking for users engaged in Hifz (memorization). Interactive quizzes, tafsir explanations, and community discussions create an educational and engaging environment. Privacy and offline mode ensure that users can access content securely anytime, anywhere. The Quran app is suitable for students, scholars, and anyone seeking a deeper understanding of the Quranic teachings, making spiritual growth and daily religious practice convenient and structured.",
    "size": "50MB",
    "reviews": "120K",
    "ratingAvg": 4.8,
    "downloads": "20M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 85000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/j9vk5ZjY/download-5.png",
    "title": "Nusuk",
    "companyName": "IslamicApps Co.",
    "id": 10,
    "description": "Nusuk is an educational Islamic app focused on providing comprehensive guidance on prayer rituals, supplications, and daily acts of worship. It offers step-by-step instructions for Salah, including illustrated guides and audio instructions for correct recitation and posture. The app covers Sunnah and Nafl prayers, fasting guidance, and other forms of worship.\n\nNusuk integrates features like prayer reminders, Qibla direction, and calendar tools to help users maintain consistency in religious practice. Advanced modules include memorization aids, Islamic etiquette tips, and thematic collections of authentic Hadith and Duas. Community features allow users to discuss practices, share insights, and attend live educational sessions. Interactive quizzes and progress tracking help reinforce learning and engagement. The app prioritizes accessibility with user-friendly navigation and offline access. Nusuk is designed for Muslims seeking to deepen their knowledge, maintain proper worship routines, and integrate spiritual learning into daily life, offering a structured and immersive experience.",
    "size": "45MB",
    "reviews": "45K",
    "ratingAvg": 4.7,
    "downloads": "15M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 32000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/BHxffWvC/download-6.png",
    "title": "Duolingo",
    "companyName": "Duolingo Inc.",
    "id": 11,
    "description": "Duolingo is a popular language-learning platform that makes acquiring new languages engaging and interactive. It offers gamified lessons in dozens of languages, covering reading, writing, speaking, and listening skills. Users progress through levels, earn points, and unlock achievements, making the learning process fun and motivating. Duolingo includes practice exercises, flashcards, and quizzes to reinforce knowledge and track progress.\n\nThe app adapts to individual learning speeds and provides personalized feedback to improve retention. Duolingo also offers chatbots for conversational practice, stories to enhance comprehension, and podcasts for immersive listening experiences. Leaderboards and streak tracking encourage consistent learning, while offline access allows users to study without internet connectivity. Duolingo caters to learners of all ages, whether beginners or advanced speakers, and is ideal for students, travelers, professionals, and language enthusiasts seeking an accessible and enjoyable language learning experience.",
    "size": "70MB",
    "reviews": "5M",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5PMVx90/download-7.png",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 12,
    "description": "ChatGPT is an advanced AI conversational platform developed by OpenAI, capable of understanding and generating human-like text across various topics. Users can interact with ChatGPT to obtain answers, explanations, writing assistance, brainstorming ideas, coding help, and much more. The platform leverages large language models to provide contextually accurate and coherent responses, simulating natural conversation.\n\nChatGPT supports multiple use cases including education, professional assistance, creative writing, programming, and daily productivity tasks. Users can ask complex questions, generate summaries, draft emails, or explore knowledge in specialized fields. The AI adapts to user input, providing clarifications, follow-up information, and step-by-step guidance. The platform is continuously updated to improve accuracy, relevance, and usability. ChatGPT provides both free and premium features, enabling developers and general users to integrate AI capabilities into personal or professional workflows. With emphasis on responsible AI usage, ChatGPT ensures safe, informative, and interactive engagement.",
    "size": "120MB",
    "reviews": "2.5M",
    "ratingAvg": 4.7,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1830000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Z17zkSvr/download-8.png",
    "title": "Gemini",
    "companyName": "Gemini Ltd.",
    "id": 13,
    "description": "Gemini is a cryptocurrency trading and investment platform that allows users to buy, sell, and manage digital assets securely. It provides tools for trading Bitcoin, Ethereum, and other popular cryptocurrencies, alongside portfolio management, market analysis, and real-time price tracking. The platform emphasizes security, compliance, and user-friendly design, ensuring that both beginners and experienced traders can engage safely and efficiently.\n\nGemini offers advanced trading features such as limit orders, recurring buys, and secure wallets. It provides educational resources to help users understand market dynamics and cryptocurrency fundamentals. Two-factor authentication, encryption, and regulatory compliance measures ensure asset safety. The mobile app allows users to trade and monitor investments on-the-go, making cryptocurrency management convenient and accessible. Gemini’s goal is to provide a transparent, reliable, and comprehensive digital asset platform for global users.",
    "size": "80MB",
    "reviews": "250K",
    "ratingAvg": 4.5,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 185000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Y7c9M7qk/download-4.jpg",
    "title": "Programming Hero",
    "companyName": "ProgrammingHero Inc.",
    "id": 14,
    "description": "ProgrammingHero is an interactive coding education platform aimed at beginners and intermediate learners. The app provides step-by-step tutorials, coding exercises, and project-based learning to help users build web, mobile, and game development skills. It includes gamified learning paths, quizzes, and challenges to enhance engagement and retention.\n\nUsers can learn programming languages like JavaScript, Python, HTML, CSS, and ReactJS, along with essential computer science concepts. The platform emphasizes hands-on projects, portfolio development, and coding best practices. Community support, mentorship, and discussion forums encourage collaborative learning. Offline lessons, progress tracking, and personalized recommendations ensure continuous growth. ProgrammingHero aims to make learning programming enjoyable, practical, and career-oriented, preparing users for real-world software development opportunities.",
    "size": "95MB",
    "reviews": "420K",
    "ratingAvg": 4.7,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 240000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZpzXPQt1/download-5.jpg",
    "title": "AlHadith",
    "companyName": "Islamic Knowledge Ltd.",
    "id": 15,
    "description": "AlHadith is an educational app dedicated to authentic Hadith collections, explanations, and daily teachings for Muslims. It offers a wide range of Hadith from major sources such as Sahih Bukhari, Sahih Muslim, and others, with translations and commentary. Users can search, bookmark, and share Hadith for study and reflection.\n\nThe app includes categorized topics, daily Hadith notifications, quizzes, and progress tracking for memorization and comprehension. Interactive learning modules, audio narration, and offline access make studying easy and flexible. Community discussions and Q&A sections provide engagement with scholars and learners. AlHadith promotes accurate understanding of Islamic teachings, enhancing religious knowledge, and daily spiritual practice for all age groups.",
    "size": "50MB",
    "reviews": "38K",
    "ratingAvg": 4.8,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 24000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/p6YCXHP9/download-6.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 16,
    "description": "Telegram is a cloud-based messaging platform that emphasizes speed, security, and privacy. It allows users to send text messages, media files, voice and video calls, and supports group chats, channels, and bots. With end-to-end encryption in secret chats, users can communicate safely and privately.\n\nTelegram offers features like file sharing up to 2GB, custom themes, message scheduling, and auto-deletion for privacy control. Channels allow broadcasting to unlimited audiences, while bots provide automation, games, and tools. Multi-device sync ensures access across smartphones, tablets, and desktops. Its open API enables developers to build applications and services on top of the platform. Telegram is widely used for personal, educational, and business communication, combining efficiency, security, and customization for global users.",
    "size": "70MB",
    "reviews": "3.2M",
    "ratingAvg": 4.5,
    "downloads": "700M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cXRtvPzz/download-7.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 17,
    "description": "Gmail is a free email service developed by Google that provides users with a secure, fast, and reliable platform for sending and receiving emails. It offers features such as spam filtering, labels, folders, search functionality, conversation view, and integration with other Google services like Drive, Calendar, and Meet. Users can customize their inboxes, set priorities, schedule emails, and enable offline access. Advanced features include smart replies, AI-based suggestions, and multiple account management. Gmail supports attachments up to 25MB and integrates with cloud storage for larger files. It also provides enterprise-level security with two-step verification, encryption, and phishing protection, making it suitable for personal, educational, and business use.",
    "size": "50MB",
    "reviews": "6M",
    "ratingAvg": 4.7,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1700000 },
      { "name": "5 star", "count": 3300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/S71KtP1Y/download-8.jpg",
    "title": "PlayStore",
    "companyName": "Google LLC",
    "id": 18,
    "description": "PlayStore is Google’s official digital distribution platform for Android apps, games, books, movies, and other digital content. Users can browse, download, install, and update applications securely, with access to millions of free and paid apps. PlayStore provides recommendations based on user preferences, ratings, and trending content. Developers can publish apps, manage updates, and track analytics through the Google Play Console. Features include in-app purchases, subscriptions, parental controls, reviews, and ratings. PlayStore ensures app security by scanning for malware and enforcing policies, offering a reliable and user-friendly ecosystem for app discovery and consumption on Android devices.",
    "size": "40MB",
    "reviews": "5.5M",
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 2600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/JFvBYbRw/download-9.png",
    "title": "Google Notes",
    "companyName": "Google LLC",
    "id": 19,
    "description": "GoogleNotes, also known as Google Keep, is a note-taking and organization application that allows users to capture ideas, lists, reminders, and multimedia content quickly and efficiently. Users can create text notes, checklists, voice recordings, and image attachments. The app supports color coding, labeling, pinning important notes, and collaboration, allowing multiple users to edit notes simultaneously. Integration with Google Drive, Calendar, and Assistant ensures seamless workflow management. GoogleNotes offers reminders based on time or location, search functionality, and offline access. It is designed to help users stay organized, enhance productivity, and keep essential information accessible across multiple devices.",
    "size": "35MB",
    "reviews": "2.8M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ymrMNRSx/download-10.png",
    "title": "Google Map",
    "companyName": "Google LLC",
    "id": 20,
    "description": "GoogleMap is a comprehensive navigation and mapping service that provides real-time GPS navigation, traffic conditions, route planning, and location search worldwide. Users can explore cities, find businesses, restaurants, and landmarks, and get public transit, walking, and cycling directions. GoogleMap offers street view, satellite imagery, and 3D mapping features. It allows users to save favorite locations, share locations with friends, and contribute reviews and photos. Integration with other Google services enhances planning and exploration. GoogleMap continuously updates traffic data and map information to ensure accuracy and reliability, making it an essential tool for travel, commuting, and discovery.",
    "size": "60MB",
    "reviews": "4M",
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/c5nv5cH/download-11.png",
    "title": "Google Meet",
    "companyName": "Google LLC",
    "id": 21,
    "description": "GoogleMeet is a secure video conferencing platform that enables businesses, educators, and individuals to conduct virtual meetings, webinars, and online classes. It offers features such as screen sharing, chat, real-time captions, meeting recordings, and integration with Google Calendar. Users can join meetings via desktop or mobile devices, with support for up to hundreds of participants. GoogleMeet emphasizes privacy and security with encryption, anti-hijacking measures, and meeting controls. It supports collaboration in real-time, making remote communication, teamwork, and learning seamless and effective.",
    "size": "55MB",
    "reviews": "1.5M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1020000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1YbFXmyk/download-12.png",
    "title": "Bkash",
    "companyName": "bkash Ltd.",
    "id": 22,
    "description": "Bkash is a leading mobile financial service in Bangladesh that allows users to send and receive money, pay bills, top-up mobile accounts, and make purchases easily. The app provides a secure and convenient digital wallet experience with features like QR code payments, bank transfers, and mobile recharge. Users can track transactions, set up scheduled payments, and access customer support directly from the app. Bkash prioritizes security with PIN authentication, OTP verification, and encryption. It is widely used by individuals and businesses for cashless transactions, financial management, and seamless digital banking services across Bangladesh.",
    "size": "35MB",
    "reviews": "500K",
    "ratingAvg": 4.6,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 375000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3xgxxhh/download-13.png",
    "title": "Nagad",
    "companyName": "Nagad Ltd.",
    "id": 23,
    "description": "Nagad is a digital financial service in Bangladesh providing fast, secure, and convenient mobile banking solutions. Users can transfer money, pay bills, top-up mobile balances, and shop online seamlessly. The app offers features like QR payments, bank integration, and transaction history tracking. Security measures include PIN authentication, OTP verification, and encrypted communication. Nagad aims to simplify financial transactions, promote cashless payments, and improve accessibility for users nationwide.",
    "size": "38MB",
    "reviews": "120K",
    "ratingAvg": 4.5,
    "downloads": "20M",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 67000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZMdJyCB/download-9.jpg",
    "title": "Rocket",
    "companyName": "Dutch-Bangla Bank Ltd.",
    "id": 24,
    "description": "Rocket is a mobile banking service that allows users to perform secure financial transactions such as sending money, paying bills, mobile recharge, and merchant payments. It integrates features like QR code scanning, transaction history, and bank account linking. Rocket focuses on user-friendly interface, fast transactions, and robust security with PINs and OTPs. It is widely used for personal and business banking needs across Bangladesh.",
    "size": "36MB",
    "reviews": "95K",
    "ratingAvg": 4.5,
    "downloads": "18M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 56000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/FqD0pX8N/download-14.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 25,
    "description": "Discord is a platform designed for creating communities, offering text, voice, and video communication for groups of all sizes. Users can join servers, create channels, chat, stream games, and collaborate efficiently. Discord supports roles, moderation, and integrations with other apps and bots. It is popular among gamers, educators, hobbyists, and professional communities for real-time interaction and engagement.",
    "size": "70MB",
    "reviews": "3M",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2340000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1GywCBzP/download-10.jpg",
    "title": "Inshort",
    "companyName": "Inshorts Inc.",
    "id": 26,
    "description": "Inshorts is a news aggregation app that delivers concise, factual news summaries in under 60 words. It covers national and international news, business, sports, technology, entertainment, and more. Users can browse categories, save articles, share with others, and personalize their news feed. Inshorts emphasizes fast, reliable, and digestible information, keeping users informed without spending much time reading long articles.",
    "size": "45MB",
    "reviews": "400K",
    "ratingAvg": 4.4,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 250000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/m5gtSgtZ/download-15.png",
    "title": "Poxalleb",
    "companyName": "Creative Labs",
    "id": 27,
    "description": "Poxalleb is a multimedia application for content creation, editing, and sharing. Users can create videos, animations, and graphic content with ease using intuitive tools, filters, and effects. The app supports exporting projects in various formats and sharing across social platforms. Poxalleb focuses on creativity, simplicity, and collaborative content creation for beginners and professionals alike.",
    "size": "65MB",
    "reviews": "50K",
    "ratingAvg": 4.3,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 18000 },
      { "name": "5 star", "count": 26000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4wGrqvpY/download-16.png",
    "title": "CamScanner",
    "companyName": "IntSig Information Co.",
    "id": 28,
    "description": "CamScanner is a document scanning app that converts physical documents into high-quality PDFs and images using smartphone cameras. It offers features like auto-cropping, OCR text recognition, cloud storage, annotations, and sharing options. Users can scan receipts, notes, invoices, and more, making document management efficient. CamScanner emphasizes productivity, security, and accessibility for personal and professional use.",
    "size": "40MB",
    "reviews": "1.2M",
    "ratingAvg": 4.5,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 875000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jFx0N4B/download-11.jpg",
    "title": "Photo",
    "companyName": "PhotoApps Inc.",
    "id": 29,
    "description": "Photo is a photography app that enables users to capture, edit, and organize images effortlessly. It includes filters, adjustment tools, collage features, and easy sharing options. Users can enhance photos, create albums, and backup images to cloud storage. Photo focuses on creativity, ease-of-use, and high-quality output for casual photographers and enthusiasts.",
    "size": "55MB",
    "reviews": "300K",
    "ratingAvg": 4.4,
    "downloads": "25M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 170000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/yF116YjH/download-12.jpg",
    "title": "PhotoEditor",
    "companyName": "Creative Labs",
    "id": 30,
    "description": "PhotoEditor is a powerful image editing app that allows users to apply filters, adjust lighting, crop, retouch, and create professional-quality images. It offers advanced tools such as layers, text addition, and AI-based enhancement features. The app supports multiple formats, easy sharing, and integrates with social media platforms. PhotoEditor aims to provide both beginners and advanced users with a versatile and user-friendly editing experience.",
    "size": "60MB",
    "reviews": "500K",
    "ratingAvg": 4.5,
    "downloads": "40M",
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 303000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ksX1f1jy/download-13.jpg",
    "title": "Video Editor",
    "companyName": "VideoLabs Inc.",
    "id": 31,
    "description": "Video Editor is a comprehensive video editing application that enables users to create, edit, and produce high-quality videos on mobile devices. It offers features such as trimming, merging, filters, transitions, text overlays, audio editing, and special effects. Users can export videos in various resolutions and share them on social media or cloud platforms. The app emphasizes ease-of-use, creative flexibility, and performance, catering to both casual users and aspiring content creators.",
    "size": "80MB",
    "reviews": "400K",
    "ratingAvg": 4.6,
    "downloads": "30M",
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 248000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mrBkkTMD/download-14.jpg",
    "title": "Video Editor",
    "companyName": "VideoLabs Inc.",
    "id": 32,
    "description": "Video Editor is a comprehensive video editing application that enables users to create, edit, and produce high-quality videos on mobile devices. It offers features such as trimming, merging, filters, transitions, text overlays, audio editing, and special effects. Users can export videos in various resolutions and share them on social media or cloud platforms. The app emphasizes ease-of-use, creative flexibility, and performance, catering to both casual users and aspiring content creators.",
    "size": "80MB",
    "reviews": "400K",
    "ratingAvg": 4.6,
    "downloads": "30M",
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 248000 }
    ]
  }
]
